## Resumen Estadistico 
### Adrián Vázquez 
#### 05/04/21

In [3]:
import pandas as pd 

datos = pd.read_csv('data-text.csv')
print(display(datos.head()))

,Indicator,PUBLISH STATES,Year,WHO region,World Bank income group,Country,Sex,Display Value,Numeric,Low,High,Comments
0,Life expectancy at birth (years),Published,1990,Europe,High-income,Andorra,Both sexes,77,77.0,NaN,NaN,NaN
1,Life expectancy at birth (years),Published,2000,Europe,High-income,Andorra,Both sexes,80,80.0,NaN,NaN,NaN
2,Life expectancy at age 60 (years),Published,2012,Europe,High-income,Andorra,Female,28,28.0,NaN,NaN,NaN
3,Life expectancy at age 60 (years),Published,2000,Europe,High-income,Andorra,Both sexes,23,23.0,NaN,NaN,NaN
4,Life expectancy at birth (years),Published,2012,Eastern Mediterranean,High-income,United Arab Emirates,Female,78,78.0,NaN,NaN,NaN

None

- Para obtener  la media, desviación, mediana y mas sobre un DataFrame, utilizamos varios metodos como:

In [6]:
# obtenemos la  media de  el conjunto de todos lo valores en  'Numeric'
print(datos['Numeric'].mean())

47.19458762886598

In [8]:
# obtenemos la  mediaana de  el conjunto de todos lo valores en  'Numeric'

print(datos['Numeric'].median())

55.0

- Maximo y minimo

In [12]:
 print(datos['Numeric'].max()) #Obtenemos el maximo 
print(datos['Numeric'].min())  #Obtenemos el minimo

87.0
11.0

<b> Para crear nuestras propias funciones y aplicarlas a un DataFrame  </b>

> utilizamos el metodo <b> .agg() </b>

<b> Hagamos una función </b>

In [14]:
# Creamos una función que nos reste los cuartiles 

def fun(column):
    return column.quantile(.75) - column.quantile(.25)

In [16]:
# mandamos a llamar esa función para ser aplicada en la columna 'Numeric' con el metodo .agg() 
print(datos['Numeric'].agg(fun))

48.0

- Podemos aplicar el mismo metodo al mismo tiempo a diferentes columnas

In [18]:
print(datos[['Numeric', 'Display Value']].agg(fun))

Numeric          48.0
Display Value    48.0
dtype: float64

- Tambien usar funciones ya establecidas al mismo tiempo que usamos la que diseñamos

In [21]:
import numpy as np
print(datos[['Numeric', 'Display Value']].agg([fun, np.mean]))

        Numeric  Display Value
fun   48.000000      48.000000
mean  47.194588      47.194588

## Estadisticas acumulativas 

<b> Són utiles para hacer seguimiento de las estadisticas resumidas a lo largo del tiempo </b>

- Utilizaremos un nuevo archivo

In [27]:
temperaturas = pd.read_csv('temperatures.csv')
print(display(temperaturas.head()))

   Unnamed: 0        date     city        country  avg_temp_c
0           0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1           1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

None

- Suma acumulada

In [29]:
# Agregamos una nueva columna 'suma acumulada' con las sumas acumuladas de la columna 
# 'avg_temp_c'
temperaturas['suma acumulada'] = temperaturas['avg_temp_c'].cumsum()
print(display(temperaturas.head()))

   Unnamed: 0        date     city        country  avg_temp_c  suma acumulada
0           0  2000-01-01  Abidjan  Côte D'Ivoire      27.293          27.293
1           1  2000-02-01  Abidjan  Côte D'Ivoire      27.685          54.978
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061          84.039
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162         112.201
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547         139.748

None

In [30]:
# Agregamos una nueva columna 'max acumulado' con los maximos acumuladas de la columna 
# 'avg_temp_c'
temperaturas['max acumulado'] = temperaturas['avg_temp_c'].cummax()
print(display(temperaturas.head()))

,Unnamed: 0,date,city,country,avg_temp_c,suma acumulada,max acumulado
0,0,2000-01-01,Abidjan,Côte D'Ivoire,27.293,27.293,27.293
1,1,2000-02-01,Abidjan,Côte D'Ivoire,27.685,54.978,27.685
2,2,2000-03-01,Abidjan,Côte D'Ivoire,29.061,84.039,29.061
3,3,2000-04-01,Abidjan,Côte D'Ivoire,28.162,112.201,29.061
4,4,2000-05-01,Abidjan,Côte D'Ivoire,27.547,139.748,29.061

None